Q1. List any five functions of the pandas library with execution.

Certainly! The pandas library is a popular data manipulation and analysis library for Python. Here are five commonly used functions along with their execution:

1. read_csv : This function is used to read data from a CSV file into a pandas DataFrame.

In [1]:
import pandas as pd
df = pd.read_csv('C:\Data Science\Files\data1.csv')
print(df)

      name   surname  gender  age    subject           email_id  phone_number
0    pooja     verma  female   21      maths    pooja@gmail.com      85798228
1   aanand     gupta    male   35    biology   aanand@gmail.com     628268865
2   dipika    maurya  female   25     Dfarma   dipika@gmail.com    6548652356
3   nikita  waghmare  female   32    nursing   nikita@gmail.com     978686183
4    anshu      shah    male   26  chemistry    anshu@gmail.com   78954685687
5   monika   gaikwad  female   21      maths   monika@gmail.com    9877857464
6    kajal     Singh  female   33         IT    kajal@gmail.com   66869746696
7   aaryan     verma    male   36      hindi   aaryan@gmail.com    6586865686
8  sanskar      modi    male   22        evs  sanskar@gmail.com   64585268365

C:\Users\POOJA\AppData\Local\Temp\ipykernel_20412\1922704426.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

2. head: The head function is used to display the first n rows of a DataFrame.

In [2]:
df.head()

     name   surname  gender  age    subject          email_id  phone_number
0   pooja     verma  female   21      maths   pooja@gmail.com      85798228
1  aanand     gupta    male   35    biology  aanand@gmail.com     628268865
2  dipika    maurya  female   25     Dfarma  dipika@gmail.com    6548652356
3  nikita  waghmare  female   32    nursing  nikita@gmail.com     978686183
4   anshu      shah    male   26  chemistry   anshu@gmail.com   78954685687

3. info: The info function provides a concise summary of a DataFrame, including the data types and the presence of missing values.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          9 non-null      object
 1   surname       9 non-null      object
 2   gender        9 non-null      object
 3   age           9 non-null      int64
 4   subject       9 non-null      object
 5   email_id      9 non-null      object
 6   phone_number  9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 636.0+ bytes

4. describe: The describe function generates descriptive statistics of the DataFrame, such as count, mean, min, and max.

In [4]:
df.describe()

             age  phone_number
count   9.000000  9.000000e+00
mean   27.888889  2.612398e+10
std     6.132790  3.339106e+10
min    21.000000  8.579823e+07
25%    22.000000  9.786862e+08
50%    26.000000  6.586866e+09
75%    33.000000  6.458527e+10
max    36.000000  7.895469e+10

5. groupby: The groupby function is used for grouping rows based on some criteria. It is often followed by an aggregation function.

In [5]:
g = df.groupby('gender')

In [6]:
g.mean('age')

          age  phone_number
gender
female  26.40  1.687215e+10
male    29.75  3.768877e+10

In [7]:
g.max()

           name   surname  age  subject           email_id  phone_number
gender
female    pooja  waghmare   33  nursing    pooja@gmail.com   66869746696
male    sanskar     verma   36    hindi  sanskar@gmail.com   78954685687

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
import pandas as pd
df1 = pd.DataFrame({
    'A': [1,2,3],
    'B': [4,5,6],
    'C': [7,8,9]})

In [9]:
index_list=[]
for i in range(1,len(df1)*2,2):
    index_list.append(i)

In [10]:
index_list

[1, 3, 5]

In [11]:
new_df = df1.set_index(pd.Index(index_list))

In [12]:
new_df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [13]:
df2 = pd.DataFrame(
    {
        'key1':[10,20,30,40,50],
        'key2':[5,10,15,20,25],
        'key3':[20,40,60,80,100],
        'key4':[15,30,45,60,75]
    }
)

In [14]:
df2

   key1  key2  key3  key4
0    10     5    20    15
1    20    10    40    30
2    30    15    60    45
3    40    20    80    60
4    50    25   100    75

In [15]:
df2.columns

Index(['key1', 'key2', 'key3', 'key4'], dtype='object')

In [16]:
for i in df2.columns:
    sum = df2[i].head(3).sum()
    print("sum of 1st 3 value of Column",i,"=",sum)

sum of 1st 3 value of Column key1 = 60
sum of 1st 3 value of Column key2 = 30
sum of 1st 3 value of Column key3 = 120
sum of 1st 3 value of Column key4 = 90

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
df3 = pd.DataFrame({'Text':['Given a Pandas DataFrame df with a column Text',' write a Python function to create a new column',' Word_Count that contains the number of words in each row of the Text column.']})

In [18]:
df3

                                                Text
0     Given a Pandas DataFrame df with a column Text
1     write a Python function to create a new column
2   Word_Count that contains the number of words ...

In [19]:
df3['Word_count'] = df3['Text'].apply(lambda x :len(x.split()))

In [20]:
df3

                                                Text  Word_count
0     Given a Pandas DataFrame df with a column Text           9
1     write a Python function to create a new column           9
2   Word_Count that contains the number of words ...          14

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [21]:
data = {'A':[1,2,3],
        'B':[4,5,6]}
df = pd.DataFrame(data)

In [22]:
df

   A  B
0  1  4
1  2  5
2  3  6

1.  DataFrame.size:

  * DataFrame.size returns the total number of elements in the DataFrame, which is equivalent to the product of the number of rows and the number of columns.
  * It represents the total number of cells in the DataFrame, including all the elements in each row and column.

In [23]:
df.size

6

2. DataFrame.shape:

  * DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the first element is the number of rows, and the second element is the number of columns.
  * It provides information about the structure of the DataFrame, indicating its size in terms of rows and columns.

In [24]:
df.shape

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

The 'read_excel' function read data from an Excel file.
Example

In [25]:
pd.read_excel('C:\Data Science\Files\data3.xlsx')

    number  val1  val2  val3  val4  val5
0        1     5    10    25    50    75
1        2    10    20    50   100   150
2        3    15    30    75   150   225
3        4    20    40   100   200   300
4        5    25    50   125   250   375
5        6    30    60   150   300   450
6        7    35    70   175   350   525
7        8    40    80   200   400   600
8        9    45    90   225   450   675
9       10    50   100   250   500   750
10      11    55   110   275   550   825
11      12    60   120   300   600   900
12      13    65   130   325   650   975
13      14    70   140   350   700  1050
14      15    75   150   375   750  1125
15      16    80   160   400   800  1200
16      17    85   170   425   850  1275
17      18    90   180   450   900  1350
18      19    95   190   475   950  1425
19      20   100   200   500  1000  1500

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [26]:
data = {'Email':['pooja@gmail.com','shanti@gmail.com','dipika@gmail.com','nikita@gmail.com','anshu@gmail.com']}

In [27]:
df = pd.DataFrame(data)

In [28]:
df

              Email
0   pooja@gmail.com
1  shanti@gmail.com
2  dipika@gmail.com
3  nikita@gmail.com
4   anshu@gmail.com

In [29]:
df['username'] = df['Email'].apply(lambda x :x.split('@')[0])

In [30]:
df

              Email username
0   pooja@gmail.com    pooja
1  shanti@gmail.com   shanti
2  dipika@gmail.com   dipika
3  nikita@gmail.com   nikita
4   anshu@gmail.com    anshu

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [31]:
import pandas as pd
data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [34]:
def select_rows(df):

    row = df[(df['A'] > 5) & (df['B'] < 10)]
    new_df = pd.DataFrame(row)
    return new_df

In [35]:
result_df = select_rows(df)

In [36]:
result_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [37]:
def test(df,col_name = 'Values'):
    mean = df[col_name].mean()
    median = df[col_name].median()
    std = df[col_name].std()

    return "Mean:",mean ,"Median:", median ,"Standard Deviation:", std

In [38]:
df1 = pd.DataFrame({'abc':['a','b','c','d','e','f','g','h','i'],
                   'Values':[1,2,3,4,5,6,7,8,9]})

In [39]:
df1

  abc  Values
0   a       1
1   b       2
2   c       3
3   d       4
4   e       5
5   f       6
6   g       7
7   h       8
8   i       9

In [40]:
test(df1, col_name = 'Values')

('Mean:', 5.0, 'Median:', 5.0, 'Standard Deviation:', 2.7386127875258306)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [41]:
data = {'Date': ['2022-01-01', '2022-01-04',  '2022-01-03', '2022-01-05', '2022-01-06', '2022-01-02','2022-01-07'],
        'Sales': [10, 15, 12, 20, 18, 25, 22]}

In [42]:
df = pd.DataFrame(data)

In [43]:
df

         Date  Sales
0  2022-01-01     10
1  2022-01-04     15
2  2022-01-03     12
3  2022-01-05     20
4  2022-01-06     18
5  2022-01-02     25
6  2022-01-07     22

In [44]:
df['Date'] = pd.to_datetime(df['Date'])

In [45]:
df.sort_values(by='Date',inplace=True)

In [46]:
df['MovingAvg'] = df['Sales'].rolling(window=7,min_periods=1).mean()

In [47]:
df

        Date  Sales  MovingAvg
0 2022-01-01     10  10.000000
5 2022-01-02     25  17.500000
2 2022-01-03     12  15.666667
1 2022-01-04     15  15.500000
3 2022-01-05     20  16.400000
4 2022-01-06     18  16.666667
6 2022-01-07     22  17.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [48]:
def week_col(df,date_col = 'Date'):

    df[date_col] = pd.to_datetime(df[date_col])
    df['Weekday'] = df[date_col].dt.day_name()

    return df

In [49]:
data = {'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05']}
df = pd.DataFrame(data)

In [50]:
df

         Date
0  2024-01-01
1  2024-01-02
2  2024-01-03
3  2024-01-04
4  2024-01-05

In [51]:
week_col(df)

        Date    Weekday
0 2024-01-01     Monday
1 2024-01-02    Tuesday
2 2024-01-03  Wednesday
3 2024-01-04   Thursday
4 2024-01-05     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [52]:
data = {'Date': ['2023-01-01', '2023-01-15', '2023-02-20', '2023-01-31', '2023-02-20', '2023-01-25', '2023-02-05'],
        'Value': [10, 15, 12, 8, 5, 9, 6]}
df = pd.DataFrame(data)

In [53]:
df

         Date  Value
0  2023-01-01     10
1  2023-01-15     15
2  2023-02-20     12
3  2023-01-31      8
4  2023-02-20      5
5  2023-01-25      9
6  2023-02-05      6

In [54]:
df['Date'] = pd.to_datetime(df['Date'])

In [55]:
df[df['Date'].between('2023-01-01','2023-01-31')]

        Date  Value
0 2023-01-01     10
1 2023-01-15     15
3 2023-01-31      8
5 2023-01-25      9

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost library that needs to be imported to use the basic functions of Pandas is the 'pandas' library itself. You typically 'import' it using the import statement in your Python script or Jupyter Notebook. The common convention is to import it with the alias 'pd'

In [56]:
import pandas as pd